# Clone Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Profile..::..Clone Method
Profile Class See Also
---
Returns a copy of this profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Profile Clone()
```

Visual Basic
---
```text
Public Function Clone As Profile
```

Visual C++
---
```text
public:
Profile^ Clone()
```

# See Also
Profile Class
Autodesk.Revit.DB Namespace